// //Виведіть за допомогою циклу стовпець чисел від 1до 100.

// for(let i = 1; i <= 100; i++) {
//     console.log(i);
// }

// // Виведіть за допомогою циклу стовпець чисел від 100до 1.

// for(let i = 100; i >= 1; i--) {
//     console.log(i);
// }

// // Виведіть за допомогою циклу стовпець парних чисел від 1до 100.

// for(let i = 1; i <= 100; i++) {
//     if(i % 2 === 0) {
//         console.log(i);
//     }
// }

// // Заповніть масив 10-ю іксами за допомогою циклу.

// let arr = [];
// for(let i = 0; i < 10; i++) {
//     arr.push('x');
// }
// console.log(arr);
// // Заповніть масив числами від 1до 10 за допомогою циклу.

// let arr1 = [];
// for(let i = 1; i <= 10; i++) {
//     arr1.push(i);
// }
// console.log(arr1);

// // Даний масив із числами. За допомогою циклу виведіть тільки ті елементи масиву, які більші за нуль і менше 10-ти.

// let arr2 = [1,2,3,4,5,15,6,16,7,18,25];
// for(let i = 0; i <= arr2.length; i++) {
//     if(arr2[i] >= 0 && arr2[i] <= 10) {
//         console.log(arr2[i]);
//     }
// }
// // Даний масив із числами. За допомогою циклу перевірте, чи є в ньому елемент зі значенням 5.

// let arr3 = [1,2,3,4,5];
// for(let i = 0; i < arr3.length; i++) {
//     if(arr3[i] === 5) {
//         console.log('Yes');
//         break;
//     } else {
//         console.log('No');
//     }

// }

// // Даний масив із числами. За допомогою циклу знайдіть суму елементів цього масиву.

// let arr4 = [1,2,3,4,5];
// let sum = 0;
// for(let i = 0; i < arr4.length; i++) {
//     sum += arr4[i];
// }
// console.log(sum);

// // Даний масив із числами. За допомогою циклу знайдіть суму квадратів елементів цього масиву.

// let arr5 = [1,2,3,4,5];
// let sum1 = 0;
// let sqrt = 0;
// for(let i = 0; i < arr5.length; i++) {
//     sqrt = Math.pow(arr5[i], 2);
//     sum1 += sqrt;
// }
// console.log(sum1);

// //Даний масив із числами. Знайдіть середнє арифметичне його елементів.

// let arr6 = [1,2,3,4,5];
// let sum2 = 0;
// for(let i = 0; i < arr4.length; i++) {
//     sum2 += arr6[i];
// }
// let result = sum2 / arr6.length;
// console.log(result);

// //Напишіть скрипт, який знаходитиме факторіал числа. Факторіал - це добуток усіх цілих чисел від одиниці до заданого числа.


// //Заповніть масив числами від 10до 1 за допомогою циклу.

// let arr7 = [];
// for(let i = 10; i >= 1; i--) {
//     arr7.push(i);
// }
// console.log(arr7);

// //Даний масив із числами. Числа можуть бути позитивними та негативними. Знайдіть суму позитивних елементів масиву.

// let arr8 = [1,-2,3,-4,5,-6,7,-8,9];
// let sum3 = 0;
// for(let i = 0; i <= arr8.length; i++) {
//     if(arr8[i] > 0) {
//         sum3 += arr8[i];
//     }
// }
// console.log(sum3);
// //Даний масив числами, наприклад: let arr = [10, 20, 30, 50, 235, 3000];
// //Виведіть на екран лише ті числа з масиву, які починаються на цифру 1або . 25

// let arr9 = [10, 20, 30, 50, 235, 3000];
// arr9 = String(arr9);
// for(let i = 0; i < arr9.length; i++) {
//     if(arr9[i][0] == 1 || arr9[i][0] == 2 || arr9[i][0] == 5) {
//         console.log(Number(arr9[i]));
//     }
// }
// //Даний масив із числами. Виведіть елементи цього масиву у зворотному порядку.
// let arr10 = [1,2,3,4,5,6,7,8,9];
// for(let i = arr10.length; i > 0; i--) {
//     console.log(arr10[i]);
// }
//Даний масив із числами. За допомогою циклу виведіть на екран усі елементи, значення яких збігаються з їх порядковим номером у масиві.

//Даний масив із числами. За допомогою циклу for та функції document.writeвиведіть кожен елемент масиву з нового рядка. Використовуйте для цього тег br.

//Даний масив із числами. За допомогою циклу for та функції document.writeвиведіть кожний елемент масиву в окремому абзаці.

//Складіть масив днів тижня. За допомогою циклу for виведіть усі дні тижня, а вихідні виведіть жирним.

// Складіть масив дней недели. За допомогою циклу forвиведіть усі дні тижня, а поточний день виведіть курсивом . Номер поточного дня повинен зберігатися у змінній day.

// Дано наступний об'єкт із працівниками та їх зарплатами:

// let obj = {
// 	employee1: 100,
// 	employee2: 200,
// 	employee3: 300,
// 	employee4: 400,
// 	employee5: 500,
// 	employee6: 600,
// 	employee7: 700,
// };
// Збільште зарплату кожного працівника на 10%.

//Модифікуйте попереднє завдання так, щоб зарплата збільшувалася тільки тим працівникам, у яких вона менша чи дорівнює 400.


// Дано такі масиви:

// let arr1 = [1, 2, 3, 4, 5];
// let arr2 = [6, 7, 8, 9, 10];
// За допомогою цих масивів створіть новий об'єкт, зробивши його ключами елементи першого масиву, а значення - елементи другого.


// Даний наступний об'єкт:  let obj = {1: 6, 2: 7, 3: 8, 4: 9, 5: 10};
// Знайдіть суму ключів цього об'єкта та поділіть її на суму значень.


// Даний наступний об'єкт:
// let obj = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5};
// Запишіть ключі об'єкта в один масив, а значення - в інший.


// Даний наступний об'єкт:

// let obj = {
// 	1: 125,
// 	2: 225,
// 	3: 128,
// 	4: 356,
// 	5: 145,
// 	6: 281,
// 	7: 452,
// };
// Запишіть у новий масив елементи, значення яких починається з цифри 1чи цифри 2. Тобто у вас в результаті вийде такий масив:

// let arr = [
// 	125,
// 	225,
// 	128,
// 	145,
// 	281,
// ];

// Даний наступний масив: let arr = ['a', 'b', 'c', 'd', 'e']; 
// Створіть із цього масиву наступний об'єкт: 
// let arr = {1: 'a', 2: 'b', 3: 'c', 4: 'd', 5: 'e'};

//Даний наступний масив: let arr = ['a', 'b', 'c', 'd', 'e'];
//Створіть із цього масиву наступний об'єкт: let arr = {'a': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5};

function getRate(callback) {
    setTimeout(() => {
        callback('Data loaded');
    }, 1000)
}

function displayData(data) {
    console.log(data);
}

getData(displayData);