// Визначте, який день тижня буде в останній день поточного місяця.

let now = new Date();

// Визначити останній день поточного місяця
let lastDayOfMonth = new Date(now.getFullYear(), now.getMonth() + 1, 0);

// Отримати день тижня (0 - Неділя, 1 - Понеділок, ..., 6 - Субота)
let dayOfWeek = lastDayOfMonth.getDay();

// Масив для виведення назв днів тижня
let daysOfWeek = ['Неділя', 'Понеділок', 'Вівторок', 'Середа', 'Четвер', 'П’ятниця', 'Субота'];

console.log(`Останній день поточного місяця припадає на ${daysOfWeek[dayOfWeek]}.`);
