// Сформуйте за допомогою трьох вкладених циклів наступний масив:
// [
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// 	[
// 		[1, 2, 3, 4, 5],
// 		[1, 2, 3, 4, 5],
// 	],
// ]
let arr = [];

for (let i = 0; i < 3; i++) {
    arr[i] = []; // Створюємо перший рівень підмасивів
    for (let j = 0; j < 2; j++) {
        arr[i][j] = []; // Створюємо другий рівень підмасивів
        for (let k = 0; k < 5; k++) {
            arr[i][j][k] = k + 1; // Заповнюємо третій рівень підмасивів числами від 1 до 5
        }
    }
}

console.log(arr);
