//Даний масив із числами. Залишіть у ньому лише позитивні числа.

let arr = [1,-2,3,-4,5,-6,7,-8,9];
console.log(arr.filter(elem => elem > 0));

//Даний масив із числами. Залишіть у ньому лише негативні числа.

let arr1 = [1,-2,3,-4,5,-6,7,-8,9];
console.log(arr1.filter(elem => elem < 0));

//Даний масив із числами. Залиште в ньому тільки числа, які більші за нуль, але менше 10.

let arr2 = [1,-2,3,-4,5,-6,7,-8,9, 12];
console.log(arr2.filter(elem => elem > 0 && elem < 10));

//Дано масив з рядками. Залиште в ньому тільки ті рядки, довжина яких більше 5 символів.

let str = ['Volodymyr', 'Tetiana', 'Stas', 'Yura', 'Yevhen'];
console.log(str.filter(elem => elem.length > 5));

//Даний масив із числами. Залишіть у ньому тільки ті числа, добуток яких на їхній порядковий номер менший 30.

let arr3 = [1,2,3,4,5,6,7,8,9];
console.log(arr3.filter(elem => elem * elem < 30)); 

//Даний масив, у ньому можуть бути звичайні елементи та підмасиви, наприклад [1, 2, [3, 4], 5, [6, 7]]. Залишіть у ньому лише звичайні елементи.



//Даний масив із числами. Порахуйте кількість негативних чисел у цьому масиві.

let arr4 = [1, 2, 3, 4, 5, -7,-8,-9];
console.log( arr4.filter(elem => elem < 0).length );
