// Даний наступний об'єкт із назвами місяців:

let months = {
    'ua': [
        'січень',
        'лютий',
        'березень',
        'квітень',
        'травень',
        'червень',
        'липень',
        'серпень',
        'вересень',
        'жовтень',
        'листопад',
        'грулень',
    ],
    'en': [
        'january',
        'february',
        'march',
        'april',
        'may',
        'june',
        'july',
        'august',
        'september',
        'october',
        'november',
        'december',
    ],
};
// Дано також такі змінні:

let lang = 'ua'; // может быть или 'ru' или 'en'
let month = 5;   // число от 0 до 11
// Виведіть на екран назву місяця, що відповідає значенням змінних lang та month.

console.log(months[lang][month]);
