//Даний масив із числами. Переберіть цей масив циклом і зведіть кожен елемент масиву в квадрат.

let arr = [1,2,3,4,5,6,7,8,9];
for(let i = 0; i < arr.length; i++) {
    arr[i] = Math.pow(arr[i], 2);
}
console.log(arr);

//Даний масив із числами. Переберіть цей масив циклом та відніміть від кожного елемента одиницю.
let arr1 = [1,2,3,4,5,6,7,8,9];
for(let i = 0; i < arr1.length; i++) {
    arr1[i] -= 1;
}
console.log(arr1);

//Даний масив із числами. Переберіть цей масив циклом і додайте до кожного елемента 10.
let arr2 = [1,2,3,4,5,6,7,8,9];
for(let i = 0; i < arr2.length; i++) {
    arr2[i] += 10;
}
console.log(arr2);