// Отримайте об'єкт із датою, що містить поточний час. Отримайте об'єкт із датою, що містить опівдні поточного дня. Порівняйте два ці об'єкти і визначте, чи був уже опівдні чи ні.
const currentDate = new Date();

// Отримати об'єкт дати з опівднем поточного дня
const noonDate = new Date();
noonDate.setHours(12, 0, 0, 0); // Встановлюємо години, хвилини, секунди та мілісекунди на опівдні

// Порівняти дати
if (currentDate >= noonDate) {
    console.log("Вже було опівдні.");
} else {
    console.log("Ще не було опівдні.");
}
