//Зробіть функцію, яка параметром набирає число, а повертає куб цього числа. За допомогою цієї функції знайдіть куб числа 3та запишіть його в змінну res.

const getCub = (num) => {
    return Math.pow(num, 3);
}
let res = getCub(5) + getCub(6);
console.log(res);


//Зробіть функцію, яка параметром набуває числа, а повертає квадратний корінь із цього числа. За допомогою цієї функції знайдіть корінь числа 3, а потім знайдіть корінь числа 4. Підсумуйте отримані результати та виведіть їх у консоль.

const getSqrt = (num1) => {
    return Math.sqrt(num1, 2);
}
let result = getSqrt(3) + getSqrt(4);
console.log(result);