//Не запускаючи код, визначте, що виведеться на екран у консоль:

console.log( typeof {x: 1, y: 2, z: 3} );

//Не запускаючи код, визначте, що виведеться в консоль:

console.log( typeof [1, 2, 3] );

//Не запускаючи код, визначте, що виведеться в консоль:

let arr = [1, 2, 3];
console.log( typeof arr );

//Не запускаючи код, визначте, що виведеться в консоль:

let arr1 = [1, 2, 3];
console.log( typeof arr1[0] );

//Не запускаючи код, визначте, що виведеться в консоль:

let arr2 = ['1', '2', '3'];
console.log( typeof arr2[0] );