// Напишіть код, який перевірятиме число на те, просте воно чи ні. Просте число ділиться тільки на одиницю і на себе, і не ділиться на інші числа.
let num = 7; // Число для перевірки
let isPrime = true; // Змінна для збереження результату

if (num <= 1) {
    isPrime = false; // Числа менші або рівні 1 не є простими
}

for (let i = 2; i < num; i++) {
    if (num % i === 0) {
        isPrime = false; // Якщо знайдено дільник, число не є простим
        break; // Завершуємо цикл, якщо знайдено дільник
    }
}

if (isPrime) {
    console.log(num + " є простим числом.");
} else {
    console.log(num + " не є простим числом.");
}
