//Даний наступний масив: let arr = [2, 5, 9, 15, 1, 4];
// Виведіть в консоль ті елементи масиву, які більше 3-х, але менше 10.

let arr = [2, 5, 9, 15, 1, 4];
for(elem of arr) {
    if(elem > 3 && elem < 10) {
        console.log(elem);
    }
}

//Даний наступний об'єкт: let obj = {a: 1, b: 2, c: 3, d: 4, e: 5};
//Виведіть у консоль ті елементи об'єкта, значення яких – непарні числа.

let obj = {a: 1, b: 2, c: 3, d: 4, e: 5};
for(let key in obj) {
    if(obj[key] % 2) {
        console.log(obj[key]);
    }
}