// Дана ось така структура для зберігання списку справ за роки, місяці та дні: Нехай дані також три змінні, що містять рік, місяць і день. Виведіть справу, яка відповідає значенням змінних.

let affairs = {
    '2018': {
        11: {
            29: ['дело111', 'дело112', 'дело113'],
            30: ['дело121', 'дело122', 'дело123'],
        },
        12: {
            30: ['дело211', 'дело212', 'дело213'],
            31: ['дело221', 'дело222', 'дело223'],
        },
    },
    '2019': {
        12: {
            29: ['дело311', 'дело312', 'дело313'],
            30: ['дело321', 'дело322', 'дело323'],
            31: ['дело331', 'дело332', 'дело333'],
        }
    },
}

let year = '2018';
let month = 11;
let day = 29;

if (affairs[year] && affairs[year][month] && affairs[year][month][day]) {
    console.log(affairs[year][month][day]);
} else {
    console.log('Даної справи не знайдено.');
}
