//За допомогою циклу for виведіть у консоль числа від 1до 100.
for(let i = 1; i <= 100; i++) {
    console.log(i);
}
//За допомогою циклу for виведіть у консоль числа від 11до 33.
for(let i = 11; i <= 33; i++) {
    console.log(i);
}
//За допомогою циклу for виведіть у консоль парні числа у проміжку від 0до 100.
for(let i = 0; i <= 100; i++) {
    console.log(i++);
}
//За допомогою циклу for виведіть у консоль непарні числа у проміжку від 1до 99.
for(let i = 1; i <= 100; i++) {
    if(i % 2) {
        console.log(i);
    }
}
//За допомогою циклу for виведіть у консоль числа від 100до 0.
for(let i = 100; i > 0; i--) {
    console.log(i);
}