// Нехай у змінній num зберігається число. Якщо це число потрапляє в діапазон від 10 до 99, то знайдіть суму цифр цього числа. Якщо отримана сума менша або дорівнює 9, то виведіть повідомлення про те, що сума цифр однозначна, в іншому випадку виведіть повідомлення про те, що сума цифр двозначна.

let num = 56;

if (num >= 10 && num <= 99) {
    // Знайдіть суму цифр числа
    let sum = num % 10 + Math.floor(num / 10);

    if (sum <= 9) {
        console.log("Сума цифр однозначна");
    } else {
        console.log("Сума цифр двозначна");
    }
} else {
    console.log("Число не потрапляє в діапазон від 10 до 99");
}
