// Нехай дано такий код: Автор коду хотів, щоб після натискання на кнопку значення цієї кнопки кожну секунду збільшувалося на 1. Однак, натисканням на кнопку взагалі нічого не відбувається. Виправте помилку автора коду. Напишіть текст, у якому дасте пояснення автору коду, чому виникла його помилка.

let elem = document.querySelector('#elem');
if (!elem.value) {
    elem.value = 0;
}

elem.addEventListener('click', function () {
    setInterval(() => {
        elem.value = Number(elem.value) + 1;
    }, 1000);
});
