//За допомогою циклу сформуйте рядок, заповнений 5тьма дефісами.

let str = '';

for (let i = 0; i < 5; i++) {
	str += '-';
}

console.log(str);

//За допомогою циклу сформуйте рядок '123456789'.

let str1 = '';

for (let i = 1; i < 10; i++) {
	str1 += i;
}

console.log(str1);

//За допомогою циклу сформуйте рядок '987654321'.

let str2 = '';

for (let i = 9; i >= 1; i--) {
	str2 += i;
}

console.log(str2);

//За допомогою циклу сформуйте рядок '-1-2-3-4-5-6-7-8-9-'.
let str3 = '';

for (let i = 1; i < 10; i++) {
	str3 = str3 + '-' + i;
}

console.log(str3 + '-');