//Зробіть функцію, яка параметром прийматиме масив і повертатиме суму його елементів.

const getArray = (arr) => {
    let sum = 0;
    for(let i = 0; i < arr.length; i++) {
        sum += arr[i];
    }
    return sum;
}
let arr = [1,2,3,4,5,6,7,8,9];
console.log(getArray(arr));

//Зробіть функцію, яка параметром прийматиме число і повертатиме масив його дільників.

const getDivisors = (num) => {
	let result = [];

	for (let i = 1; i <= num; i++) {
		if(num % i == 0) {
			result.push(i);
		}
	}

	return result;
}

console.log(getDivisors(54));


//Зробіть функцію, яка параметром прийматиме рядок і повертатиме масив її символів.

const getString = (str) => {
	let x = str.split('.');
	let arr = [];
	for(let i = 0; i < str.length; i++) {
		let z = x[i];
		let w = z.split(' ');
		arr.push(w[0]);
	}
	return arr.join(',')
}
console.log(getString('Yevhen Prkopiv'));

//Зробіть функцію, яка параметром прийматиме рядок і перевертатиме її символи у зворотному порядку.

//Зробіть функцію, яка параметром прийматиме рядок і робитиме заголовною першу літеру цього рядка.

//Зробіть функцію, яка параметром прийматиме рядок і робитиме заголовною першу літеру кожного слова цього рядка.

//Зробіть функцію, що заповнює масив цілими числами від 1заданого.


//Зробіть функцію, яка повертатиме випадковий елемент із масиву.

//Зробіть функцію, яка параметром прийматиме число і перевірятиме, просте воно чи ні.

//Зробіть функцію, яка перевірятиме пару чисел на дружність. Дружні числа - два числа, котрим сума всіх власних дільників першого числа дорівнює другому числу і навпаки, сума всіх власних дільників другого числа дорівнює першому числу.

//Використовуючи створену вами функцію з попереднього завдання, знайдіть усі пари дружніх чисел у проміжку від 1до 1000.

//Зробіть функцію, яка перевірятиме число на досконалість. Досконале число - це число, сума своїх дільників якого дорівнює цьому числу.

//Знайдіть усі щасливі квитки. Щасливий квиток - це квиток, у якому сума перших трьох цифр його номера дорівнює сумі трьох цифр його номера.

//Зробіть функцію, яка параметром прийматиме два числа і повертатиме масив їх спільних дільників.

//Зробіть функцію, яка прийматиме рядок російською мовою, а повертатиме її трансліт.