// Нехай функція testпершим параметром приймає число, а другим і третім параметрами - функції, також параметром числа, що приймають. Нехай функція testповертає суму результатів переданих функцій: Викличте функцію test, першим параметром передавши число 3, другим параметром функцію, що зводить число квадрат, а третім - функцію, що зводить число в куб. Виведіть результат роботи у консоль.

function test(num, func1, func2) {
    return func1(num) + func2(num);
}

var square = function (x) {
    return x * x;
};

var cube = function (x) {
    return x * x * x;
};

var result = test(3, square, cube);
console.log(result); // Результат виведеться у консоль: 36 (3^2 + 3^3 = 9 + 27 = 36)
