// Даний наступний об'єкт:

// let obj = {
// 	1: 125,
// 	2: 225,
// 	3: 128,
// 	4: 356,
// 	5: 145,
// 	6: 281,
// 	7: 452,
// };
// Запишіть у новий масив елементи, значення яких починається з цифри 1 чи цифри 2. Тобто у вас в результаті вийде такий масив:

// [
// 	125,
// 	225,
// 	128,
// 	145,
// 	281,
// ];

let obj = {
    1: 125,
    2: 225,
    3: 128,
    4: 356,
    5: 145,
    6: 281,
    7: 452,
};
let arr = [];
for (let elem in obj) {
    let str = String(obj[elem]);
    if (str[0] === '1' || str[0] === '2') {
        arr.push(str);
    }
}

console.log(arr);
