//Даний наступний код:

let test = {x: 1, y: 2, z: 3};
console.log(test);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Даний наступний код:

let test1 = {x: 1, y: 2, z: 3};
console.log(test1.x);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Даний наступний код:

let test2 = [1, 2, 3];
console.log(test2);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Даний наступний код:

let test3 = [1, 2, 3];
console.log(test3[1]);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Даний наступний код:

let test4 = [1, 2, 3];
let test5 = 1;

console.log(test4);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Даний наступний код:

let test6 = [1, 2, 3];
let test7 = 1;

console.log(test6[test7]);
//Який тип даних виведеться в консоль? Це примітив чи об'єкт?

//Не підглядаючи в підручник перерахуйте всі примітивні типи даних JavaScript.