//Створіть масив із елементами 'a', 'b', 'c'. Запишіть замість першого елемента число 1замість другого - 2замість третього - 3.
let arr = ['a', 'b', 'c'];
arr[0] = 1;
arr[1] = 2;
arr[2] = 3;
console.log(arr);
//Створіть масив із числами. Додайте до кожного елемента масиву число 3. Виведіть змінений масив на екран.
let arr1 = [1,2,3];
arr1[0] += 3;
arr1[1] += 3;
arr1[2] += 3;
console.log(arr1);
//Створіть масив з елементами 1і . За допомогою оператора збільште кожний елемент масиву на одиницю. 23++
let arr2 = [1, 2, 3];
arr2[0]++;
arr2[1]++,
arr2[2]++
console.log(arr2);