//Даний масив із числами. Запустіть цикл, який по черзі виводитиме елементи цього масиву в консоль доти, доки не зустрінеться елемент зі значенням 0. Після цього цикл має завершити свою роботу.

let arr = [1,2,3,4,5,0,7,8,9];
for(let elem of arr) {
    if(elem == 0) {
        console.log('true');
        break;
    }
}

//Даний масив із числами. Знайдіть суму елементів, розташованих від початку масиву до першого від'ємного числа.
let arr1 = [1,2,3,4,5,-2, -6,-5,-9.-8];
let sum = 0;
for(let i = 0; i < arr1.length; i++) {
    if(arr1[i] > 0) {
        sum += arr1[i];
    }
}
console.log(sum);
