//Дано два масиви: перший з назвами днів тижня, а другий - з їхніми порядковими номерами:

let arr1 = ['пн', 'вт', 'ср', 'чт', 'пт', 'сб', 'вс'];
let arr2 = [1, 2, 3, 4, 5, 6, 7];
let obj = {};
for(let i = 0; i <= 6; i++) {
    obj[arr1[i]] = arr2[i];
}
console.log(obj);
//За допомогою циклу створіть об'єкт, ключами якого будуть назви днів, а значення - їх номери.
//Даний об'єкт:

let obj1 = {a: 1, b: 2, c: 3, d: 4, e: 5};
let newObj = {};
for(let i = 0; i <= 4; i++) {
    if(obj1[keys] % 0) {
        newObj = obj1[i];
    }
}
console.log(newObj);
//Переберіть цей об'єкт циклом і запишіть у новий об'єкт елементи, які є парними числами.

//Даний об'єкт:
let obj2 = {a: 1, b: 2, c: 3, d: 4, e: 5};
//Переберіть цей об'єкт циклом і створіть новий об'єкт так, щоб його ключами стали елементи старого об'єкта, а значення - ключі старого об'єкта.