// Нехай у змінній num зберігається число. Якщо це число потрапляє в діапазон від 10 до 99, знайдіть суму цифр цього числа. Якщо отримана сума менша або дорівнює 9, виведіть повідомлення про те, що сума цифр однозначна, інакше виведіть повідомлення про те, що сума цифр двозначна.

let num = 68;
let sum = 0;
let numStr = String(num);

if (num >= 10 && num <= 99) {
    for (let i = 0; i < numStr.length; i++) {
        sum += Number(numStr[i]);
    }

    if (sum <= 9) {
        console.log('Сума цифр однозначна')
    } else {
        console.log('Сума цифр двозначна');
    }
}
