// Нехай у змінній num зберігається число. Якщо це число потрапляє в діапазон від 10 до 99, знайдіть суму цифр цього числа. Якщо отримана сума менша або дорівнює 9, виведіть повідомлення про те, що сума цифр однозначна, інакше виведіть повідомлення про те, що сума цифр двозначна.

let num = 65;
if (num >= 10 && num <= 99) {
    let sum = Math.floor(num / 10) + (num % 10);
    if (sum <= 9) {
        console.log('Сума цифр однозначна');
    } else {
        console.log('Сума цифр двозначна');
    }
} else {
    console.log('Число не входить у діапазон від 10 до 99');
}
