// Нехай функція test першим параметром приймає число, а другим і третім параметрами - функції, також параметром числа, що приймають. Нехай функція testповертає суму результатів переданих функцій: Викличте функцію test, першим параметром передавши число 3, другим параметром функцію, що зводить число квадрат, а третім - функцію, що зводить число в куб. Виведіть результат роботи у консоль.


function test(num, func1, func2) {
    return func1(num) + func2(num);
}

function func1(num) {
    return Math.pow(num, 2);
}

function func2(num) {
    return Math.pow(num, 3);
}

console.log(test(3, func1, func2));
