//Переберіть циклом числа від 10 до 1000 та виведіть у консоль першу цифру кожного числа.

for(let i = 10; i <= 1000; i++) {
    let str = String(i);
    if(str[0] === '1') {
        console.log(i);
    }
}

//Переберіть циклом числа від 10до 1000 та виведіть у консоль суму першої та другої цифри кожного числа.
let sum = 0;
for(let i = 10; i < 1000; i++) {
    let str1  = String(i);
    sum = str1[0] + str1[1];
}
console.log(sum);
//Переберіть циклом числа від 10до 1000 та виведіть ті числа, перша цифра яких дорівнює 1.

//Переберіть циклом числа від 10до 1000 і виведіть ті цифри, сума двох перших цифр яких дорівнює 5.